softwares/resilio.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-16 四 17:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Resilio</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="刘尚亮" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">Resilio</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8a0a94b">1. 概述</a></li>
<li><a href="#orgc6db9f2">2. 安装</a>
<ul>
<li><a href="#org3d990e8">2.1. Windows &amp; Mac</a></li>
<li><a href="#org5df4eaa">2.2. Linux</a></li>
<li><a href="#org100fcab">2.3. linux 服务端</a>
<ul>
<li><a href="#org8412746">2.3.1. 配置 https 进行访问</a></li>
</ul>
</li>
<li><a href="#orgdc3e621">2.4. 配置文件启动</a></li>
</ul>
</li>
<li><a href="#org0f390bc">3. 存储文件夹(Storage Folder)</a></li>
<li><a href="#org2355c04">4. 配置选项</a>
<ul>
<li><a href="#orgc422932">4.1. 通用(General)</a></li>
<li><a href="#org43fd259">4.2. 身份(Identity)</a></li>
<li><a href="#org39af45d">4.3. 高级</a></li>
</ul>
</li>
<li><a href="#org14ec401">5. 使用</a>
<ul>
<li><a href="#org60c7a73">5.1. 同步文件夹</a>
<ul>
<li><a href="#org81dfa76">5.1.1. 标准文件夹</a></li>
<li><a href="#org9709c96">5.1.2. 高级文件夹</a></li>
<li><a href="#orgfaf225e">5.1.3. 加密文件夹</a>
<ul>
<li><a href="#org3144dca">5.1.3.1. 从加密的节点还原文件</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge90cf60">5.2. 同步文件</a></li>
<li><a href="#org174748f">5.3. 重置 web UI 密码</a></li>
<li><a href="#org8c845b4">5.4. 链接设备到同 Identity 下</a></li>
</ul>
</li>
<li><a href="#org33fa4d5">6. 购买许可证</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8a0a94b" class="outline-2">
<h2 id="org8a0a94b"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
Resilio Sync（以前称为 BitTorrent Sync）是 Resilio，Inc.发布的免费，快速，p2p 文件共享和同步工具。它可用于 Linux，Mac，FreeBSD，Windows，Android，iOS 和 NAS 设备。
</p>
</div>
</div>

<div id="outline-container-orgc6db9f2" class="outline-2">
<h2 id="orgc6db9f2"><span class="section-number-2">2</span> 安装</h2>
<div class="outline-text-2" id="text-2">
<p>
各平台使用软件包进行安装，Linux 安装指南 <a href="https://help.resilio.com/hc/en-us/articles/206178924">https://help.resilio.com/hc/en-us/articles/206178924</a>， linux 上的软件安装有点问题，“<a href="http://linux-packages.resilio.com/resilio-sync/key.asc">http://linux-packages.resilio.com/resilio-sync/key.asc</a>” 这个文件下载不下来
</p>
</div>

<div id="outline-container-org3d990e8" class="outline-3">
<h3 id="org3d990e8"><span class="section-number-3">2.1</span> Windows &amp; Mac</h3>
</div>

<div id="outline-container-org5df4eaa" class="outline-3">
<h3 id="org5df4eaa"><span class="section-number-3">2.2</span> Linux<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></h3>
<div class="outline-text-3" id="text-2-2">
<p>
ubuntu 上 resilio 使用 web 作为 gui 界面，生成示例配置文件：
</p>
<div class="org-src-container">
<pre class="src src-sh">rslsync --dump-sample-config &gt; resilio.conf
</pre>
</div>

<p>
编辑配置文件 resilio.conf
</p>
<div class="org-src-container">
<pre class="src src-json">{
   <span style="color: #a1db00;">"device_name"</span>: <span style="color: #ff4ea3;">"phenix-ali-vps"</span>,

    /* storage_path dir contains auxilliary app files if no storage_path field: .sync dir created in current working directory */
   <span style="color: #a1db00;">"storage_path"</span> : <span style="color: #ff4ea3;">"/home/phenix/.sync"</span>,

   /* use UPnP for port mapping */
   <span style="color: #a1db00;">"use_upnp"</span> : <span style="color: #5fafd7;">true</span>,

   /* limits in kB/s. <span style="color: #5fafd7;">0</span> - no limit */
   <span style="color: #a1db00;">"download_limit"</span> : <span style="color: #5fafd7;">0</span>,
   <span style="color: #a1db00;">"upload_limit"</span> : <span style="color: #5fafd7;">0</span>,

  /* directory_root path defines where the WebUI Folder browser starts (linux only). Default value is / */
  <span style="color: #a1db00;">"directory_root"</span> : <span style="color: #ff4ea3;">"/home/phenix/resilio_sync/"</span>,
  <span style="color: #a1db00;">"webui"</span> :
  {
    <span style="color: #a1db00;">"listen"</span> : <span style="color: #ff4ea3;">"127.0.0.1:8888"</span> // remove field to disable WebUI
  }
}
</pre>
</div>

<p>
启动服务：
</p>
<div class="org-src-container">
<pre class="src src-sh">rslsync --config resilio.conf
</pre>
</div>

<p>
服务以守护程序运行，Resilio Sync 守护程序将侦听 <code>resilio.conf</code> 配置文件中指定的 <code>127.0.0.1:8888</code> 。现在，可以在 Web 浏览器地址栏输入 <code>https://127.0.0.1:8888</code> 访问 Resilio Sync Web UI。
</p>

<p>
然后将被要求设置用户名和密码来保护 Web UI。
</p>
</div>
</div>

<div id="outline-container-org100fcab" class="outline-3">
<h3 id="org100fcab"><span class="section-number-3">2.3</span> linux 服务端</h3>
<div class="outline-text-3" id="text-2-3">
<p>
如果不想直接对外暴露 resilio 的端口，需要使用 nginx 做反向代理，nginx 配置文件：resilio.proxy.nginx.conf
</p>
<div class="org-src-container">
<pre class="src src-nginx"><span style="color: #a1db00;">server</span> {
    <span style="color: #a1db00;">listen</span> 80;
    <span style="color: #a1db00;">server_name</span> resilio.your-domain;

    <span style="color: #a1db00;">access_log</span> /var/log/nginx/resilio.access.log;
    <span style="color: #a1db00;">error_log</span> /var/log/nginx/resilio.error.log;
    <span style="color: #a1db00;">location</span> <span style="color: #ffd700;">/</span> {
        <span style="color: #a1db00;">proxy_pass</span> http://127.0.0.1:8888;
        <span style="color: #a1db00;">proxy_set_header</span> Host <span style="color: #ff8700;">$host</span>;
        <span style="color: #a1db00;">proxy_set_header</span> X-Real-IP <span style="color: #ff8700;">$remote_addr</span>;
        <span style="color: #a1db00;">proxy_set_header</span> X-Forwarded-For <span style="color: #ff8700;">$proxy_add_x_forwarded_for</span>;
    }
}
</pre>
</div>
<p>
由于 vps 服务端部署好之后，没办法通过 web gui 设置密码，所以需要修改配置文件， <code>/etc/resilio-sync/config.json</code>
</p>
<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #a1db00;">"storage_path"</span> : <span style="color: #ff4ea3;">"/var/lib/resilio-sync/"</span>,
    <span style="color: #a1db00;">"pid_file"</span> : <span style="color: #ff4ea3;">"/var/run/resilio-sync/sync.pid"</span>,

    <span style="color: #a1db00;">"webui"</span> :
    {
        <span style="color: #a1db00;">"listen"</span> : <span style="color: #ff4ea3;">"127.0.0.1:8888"</span>,
        <span style="color: #a1db00;">"login"</span>:<span style="color: #ff4ea3;">"username"</span>,
        <span style="color: #a1db00;">"password"</span>:<span style="color: #ff4ea3;">"password"</span>
    }
}
</pre>
</div>
<p>
然后就可以通过 <a href="http://resilio.your-domain/gui">http://resilio.your-domain/gui</a> 进行访问了，要注意，此时 <b>只能通过 http 进行访问</b> 。
</p>
</div>

<div id="outline-container-org8412746" class="outline-4">
<h4 id="org8412746"><span class="section-number-4">2.3.1</span> 配置 https 进行访问</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
给 resilio.your-domain 申请好阿里云免费的 HTTPs 证书后，修改 resilio.proxy.nginx.conf 文件。
</p>
<div class="org-src-container">
<pre class="src src-nginx"><span style="color: #a1db00;">server</span> {
    <span style="color: #a1db00;">listen</span> 443 ssl;
    <span style="color: #a1db00;">server_name</span> resilio.your-domain;

    <span style="color: #a1db00;">ssl_certificate</span> /home/phenix/nginx/ssl/resilio.your-domain.pem;   <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#26367;&#25442;&#25104;&#24744;&#35777;&#20070;&#30340;&#25991;&#20214;&#21517;&#12290;</span>
    <span style="color: #a1db00;">ssl_certificate_key</span> /home/phenix/nginx/ssl/resilio.your-domain.key;   <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#26367;&#25442;&#25104;&#24744;&#35777;&#20070;&#30340;&#23494;&#38053;&#25991;&#20214;&#21517;&#12290;</span>
    <span style="color: #a1db00;">ssl_session_timeout</span> 5m;
    <span style="color: #a1db00;">ssl_ciphers</span> ECDHE-RSA-AES128-GCM-SHA256:ECDHE:ECDH:AES:HIGH:!NULL:!aNULL:!MD5:!ADH:!RC4;  <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">&#20351;&#29992;&#27492;&#21152;&#23494;&#22871;&#20214;&#12290;</span>
    <span style="color: #a1db00;">ssl_protocols</span> TLSv1 TLSv1.1 TLSv1.2;   <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">&#20351;&#29992;&#35813;&#21327;&#35758;&#36827;&#34892;&#37197;&#32622;&#12290;</span>
    <span style="color: #a1db00;">ssl_prefer_server_ciphers</span> <span style="color: #5fafd7;">on</span>;

    <span style="color: #a1db00;">access_log</span> /var/log/nginx/resilio.access.log;
    <span style="color: #a1db00;">error_log</span> /var/log/nginx/resilio.error.log;

    <span style="color: #a1db00;">location</span> <span style="color: #ffd700;">/</span> {
        <span style="color: #a1db00;">proxy_pass</span> http://127.0.0.1:8888<span style="color: #ff8700;">$request_uri</span>;
        <span style="color: #a1db00;">proxy_set_header</span> Host <span style="color: #ff8700;">$host</span>;
        <span style="color: #a1db00;">proxy_set_header</span> X-Real-IP <span style="color: #ff8700;">$remote_addr</span>;
        <span style="color: #a1db00;">proxy_set_header</span> X-Forwarded-For <span style="color: #ff8700;">$proxy_add_x_forwarded_for</span>;
    }
}

<span style="color: #a1db00;">server</span> {
    <span style="color: #a1db00;">listen</span> 80;                  <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#37325;&#23450;&#21521;HTTP&#35831;&#27714;&#20026;HTTPs</span>
    <span style="color: #a1db00;">server_name</span> resilio.your-domain;
    <span style="color: #a1db00;">return</span> 301 https://resilio.your-domain<span style="color: #ff8700;">$request_uri</span>;
}
</pre>
</div>
<p>
现在可以通过 http(s)://resilio.your-domain 直接访问 resilio web gui 域名
</p>
</div>
</div>
</div>

<div id="outline-container-orgdc3e621" class="outline-3">
<h3 id="orgdc3e621"><span class="section-number-3">2.4</span> 配置文件启动<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></h3>
<div class="outline-text-3" id="text-2-4">
<p>
在配置模式下运行同步使您可以在程序启动时应用预配置的参数。如果您需要在许多不同的计算机上应用相同的设置，这将非常有帮助。
</p>
</div>
</div>
</div>

<div id="outline-container-org0f390bc" class="outline-2">
<h2 id="org0f390bc"><span class="section-number-2">3</span> 存储文件夹(Storage Folder)<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup></h2>
<div class="outline-text-2" id="text-3">
<p>
Sync 使用存储文件夹保留其当前配置、辅助设置文件、共享数据库等的目录。您可以从此处收集支持人员请求的日志等信息。
</p>

<p>
要更改桌面上版的默认位置，请在配置模式下<sup><a id="fnr.2.100" class="footref" href="#fn.2">2</a></sup>运行同步。该文件夹的默认位置如下：
</p>
<ul class="org-ul">
<li><p>
windows
</p>

<p>
(will be Resilio Sync Service if you run Sync as service)
</p>
<pre class="example">
C:\Users\user_name\AppData\Roaming\Resilio Sync\
</pre>

<p>
Sync running as service with LocalService:
</p>
<pre class="example">
C:\Windows\ServiceProfiles\LocalService\AppData\Roaming\Resilio Sync Service
</pre>

<p>
Sync running as service with Local System:
</p>
<pre class="example">
C:\Windows\System32\config\systemprofile\AppData\Roaming\Resilio Sync Service
</pre></li>

<li>Mac: /Users/user_name/Library/Application Support/Resilio Sync</li>

<li>Linux: ./sync near binary file or the current directory from which you launch Sync, or the path defined as "storage_path" if you run Sync in config mode</li>

<li><p>
Linux packages:
如果以 rslsync 身份启动：
</p>
<pre class="example">
/var/lib/resilio-sync
</pre>
<p>
如果是当前用户启动：
</p>
<pre class="example">
/home/username/.config/resilio-sync/storage
</pre></li>
</ul>
</div>
</div>

<div id="outline-container-org2355c04" class="outline-2">
<h2 id="org2355c04"><span class="section-number-2">4</span> 配置选项</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgc422932" class="outline-3">
<h3 id="orgc422932"><span class="section-number-3">4.1</span> 通用(General)</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>设备名称（device_name）</li>
<li>默认文件夹位置(default folder location)：同步文件夹的默认存放位置。</li>
<li>文件下载位置(default file location)：同步文件的默认存放位置。</li>
</ul>
</div>
</div>

<div id="outline-container-org43fd259" class="outline-3">
<h3 id="org43fd259"><span class="section-number-3">4.2</span> 身份(Identity)</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li><p>
身份（Identity）<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>
</p>

<p>
身份是 Sync 中可用的最强大的功能之一。 Sync 要求在首次启动时提供身份名称。此名称将用于为您的 Sync 实例生成数字证书和随机指纹。这些将在以后与其他对等方的进一步连接时用到，看到指纹和其他名称，即可知道哪个 Sync 安装正在尝试连接至它们。
</p>

<p>
使用许可证的 Sync Home Pro，Sync family Pro 和 Sync Business 允许多个设备通过同一标识链接在一起，它们展示在“我的设备（my devices）”列表中。通过将台式机，笔记本电脑和手机/平板电脑与 Sync 的 PKI 实施链接起来，您可以安全地将所有数据存储到任何设备上，而无需在云中创建帐户。首次打开 Sync 时创建的唯一数字证书具有文件夹权限，与其他设备建立连接并为 Sync Pro 授予许可。
</p></li>

<li><p>
当前设备设置（this device setting）
</p>

<p>
主要是选择设备同步模式：全同步，选择同步和不同步。<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup>
</p></li>

<li><p>
设备列表（My Devices）
</p>

<p>
显示在当前身份下链接的设备列表。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org39af45d" class="outline-3">
<h3 id="org39af45d"><span class="section-number-3">4.3</span> 高级</h3>
</div>
</div>

<div id="outline-container-org14ec401" class="outline-2">
<h2 id="org14ec401"><span class="section-number-2">5</span> 使用<sup><a id="fnr.6" class="footref" href="#fn.6">6</a></sup></h2>
<div class="outline-text-2" id="text-5">
<p>
resilio 可以用来同步文件夹和单个文件。
</p>
</div>

<div id="outline-container-org60c7a73" class="outline-3">
<h3 id="org60c7a73"><span class="section-number-3">5.1</span> 同步文件夹</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org81dfa76" class="outline-4">
<h4 id="org81dfa76"><span class="section-number-4">5.1.1</span> 标准文件夹</h4>
</div>
<div id="outline-container-org9709c96" class="outline-4">
<h4 id="org9709c96"><span class="section-number-4">5.1.2</span> 高级文件夹</h4>
</div>
<div id="outline-container-orgfaf225e" class="outline-4">
<h4 id="orgfaf225e"><span class="section-number-4">5.1.3</span> 加密文件夹<sup><a id="fnr.7" class="footref" href="#fn.7">7</a></sup></h4>
<div class="outline-text-4" id="text-5-1-3">
<p>
加密文件夹背后的整个想法是在不受信任的设备上拥有自己的对等设备，而不泄露任何数据。文件在传输前已加密，并且未在目标位置解密。
</p>

<p>
例如，您可以将共享文件夹的副本添加到 VPS 或可供公众使用的设备，而不必担心其他人会读取或使用您的数据。此外，这个由 VPS 托管的对等方将全天 24 小时为您的数据播种，因此，如果其他对等方脱机，您仍然可以访问数据。
</p>

<p>
系统将提示您选择一个文件夹，该文件夹中将存储来自源计算机的加密数据。使用系统的文件浏览器创建一个加密目录。
</p>

<p>
注意：不要使用非空目录。已经存在的文件将不会被加密，并且只会被 Sync 忽略。如果您选择的目录中包含先前使用相同 F 键加密的文件，则这些文件仍将重新同步并移至存档。这将导致设备占用更多空间。
</p>

<p>
您可以从备份计算机进一步共享此文件夹，尽管只能以加密格式共享。
</p>
</div>

<div id="outline-container-org3144dca" class="outline-5">
<h5 id="org3144dca"><span class="section-number-5">5.1.3.1</span> 从加密的节点还原文件</h5>
<div class="outline-text-5" id="text-5-1-3-1">
<p>
备份计算机上的加密文件夹（仅具有 F 键的文件夹）具有只读权限，“覆盖所有已更改的文件”选项始终处于激活状态，并且“选择性同步”不可用。这意味着，如果您或其他人删除此对等方上的文件，则 Sync 将从其他对等方再次下载它们，当然前提是它们在线且具有文件。
</p>

<p>
加密的节点没有解密机制，因此无法解密文件。
</p>

<p>
但是，在文件对等方源由于某种原因而失败的情况下，有机会从加密的备份对等方获取文件。为此，必须满足两个条件：
</p>
<ol class="org-ol">
<li>将 RW 和 RO（分别为 D-和 E-）键保存到此文件夹中的某个位置。</li>
<li>不要从加密节点上的同步中删除加密文件夹，以使数据库保持与最初创建的相同。</li>
</ol>

<p>
在这种情况下，您可以使用主工作站上的 RW 键。它将连接到加密的节点并从中获取文件。 RW 密钥（D-密钥）可以解密它们。
</p>

<p>
解密文件的另一种方法是在命令行界面中使用 command 在加密节点上本地执行操作
</p>
<div class="org-src-container">
<pre class="src src-sh">--decrypt &lt;secret&gt; &lt;db path&gt; &lt;encrypted folder&gt; &lt;output folder&gt;
</pre>
</div>

<p>
&lt;secret&gt;是源对等方的 RW 密钥。
&lt;db path&gt;是数据库文件的完整路径。可以从 debug sync.log 中获知数据库名称：查找字符串“ started 周期性扫描”，然后在其中查看 shareID。数据库文件的名称末尾将带有这些。否则，请联系支持人员并将调试日志提交给他们。
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orge90cf60" class="outline-3">
<h3 id="orge90cf60"><span class="section-number-3">5.2</span> 同步文件<sup><a id="fnr.8" class="footref" href="#fn.8">8</a></sup></h3>
<div class="outline-text-3" id="text-5-2">
<p>
需要注意的是：
</p>
<ul class="org-ul">
<li>文件传输是单次单向的。这意味着如果共享文件发生更改，此传输将无效并且更改将不再同步。要同步更改的文件，请将它们再次添加到“同步”并生成新链接。</li>
<li>接收文件的对等方可以进一步共享它们。他们不能更改链接的到期日期。</li>
<li>如果链接已过期，则需要再次将文件添加到“同步”并生成新链接。</li>
<li>如果目标对等方在选定目录中已经具有相同名称的文件，则 Sync 将在新目录中添加（1）索引并在 UI 中显示相应的消息。</li>
<li>从 Sync UI 中删除文件不会将其从设备中删除。同样，从设备中删除文件不会从 Sync UI 中删除它，但是文件将不再上载。</li>
</ul>
</div>
</div>

<div id="outline-container-org174748f" class="outline-3">
<h3 id="org174748f"><span class="section-number-3">5.3</span> 重置 web UI 密码<sup><a id="fnr.9" class="footref" href="#fn.9">9</a></sup></h3>
<div class="outline-text-3" id="text-5-3">
<p>
Sync 的 WebUI 受登录/密码保护，该密码是您在首次打开 WebUI 时定义的。这不是您的用户帐户的密码，也不与您可能拥有的任何其他帐户相关。这只是防止未经授权访问 Sync WebUI 的唯一保护措施。当网络浏览器会话结束时，同步的 cookie 会过期。
</p>

<p>
如果您丢失/忘记了 WebUI 密码，则可以在同步存储文件夹中手动删除登录名和密码设置。请注意，这将导致“我的设备”列表中的设备重复。它不会影响同步共享，您可以忽略它。另外，偏好设置中的全局设置将重置为默认值。
</p>

<p>
要重置登录名和密码设置，请按照下列步骤操作：
</p>
<ol class="org-ol">
<li>退出同步并关闭 WebUI。</li>
<li>转到同步存储文件夹。</li>
<li>找到并删除以下文件： settings.dat settings.dat.old</li>
<li>删除文件后，重新启动同步，打开 WebUI 并输入新的登录名和密码。</li>
</ol>
</div>
</div>

<div id="outline-container-org8c845b4" class="outline-3">
<h3 id="org8c845b4"><span class="section-number-3">5.4</span> 链接设备到同 Identity 下<sup><a id="fnr.4.100" class="footref" href="#fn.4">4</a></sup></h3>
</div>
</div>

<div id="outline-container-org33fa4d5" class="outline-2">
<h2 id="org33fa4d5"><span class="section-number-2">6</span> 购买许可证</h2>
<div class="outline-text-2" id="text-6">
<p>
如果只是需要进行资源分享，不需要对分享对象的权限进行控制，免费版就足够了。
</p>

<p>
如果需要在自己的多个设备之间同步资料，需要用到以下特性，需要购买 HOME one user 的许可证：
</p>
<ul class="org-ul">
<li>多个设备之间自动同步，不需要通过 resilio 的二维码或者连接手动进行同步。</li>
<li>需要对同步的文件（夹）进行选择同步。</li>
</ul>


<p>
简而言之，如果只是分享资源，免费版就够了，如果想要不同设备间同步多个文件（夹），还是推荐买个授权。
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.linuxbabe.com/ubuntu/install-resilio-sync-ubuntu-16-04-16-10">https://www.linuxbabe.com/ubuntu/install-resilio-sync-ubuntu-16-04-16-10</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://help.resilio.com/hc/en-us/articles/206178884-Running-Sync-in-configuration-mode">https://help.resilio.com/hc/en-us/articles/206178884-Running-Sync-in-configuration-mode</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
<a href="https://help.resilio.com/hc/en-us/articles/206664690-Sync-Storage-folder">https://help.resilio.com/hc/en-us/articles/206664690-Sync-Storage-folder</a>#
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
<a href="https://help.resilio.com/hc/en-us/articles/205457815-Sync-Private-Identity-Linking-My-Devices">https://help.resilio.com/hc/en-us/articles/205457815-Sync-Private-Identity-Linking-My-Devices</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5">5</a></sup> <div class="footpara"><p class="footpara">
<a href="https://help.resilio.com/hc/en-us/articles/205457775-Synchronization-Modes">https://help.resilio.com/hc/en-us/articles/205457775-Synchronization-Modes</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6">6</a></sup> <div class="footpara"><p class="footpara">
<a href="https://help.resilio.com/hc/en-us/articles/204755009-Sync-Main-View-Desktop">https://help.resilio.com/hc/en-us/articles/204755009-Sync-Main-View-Desktop</a>-
</p></div></div>

<div class="footdef"><sup><a id="fn.7" class="footnum" href="#fnr.7">7</a></sup> <div class="footpara"><p class="footpara">
<a href="https://help.resilio.com/hc/en-us/articles/207370466">https://help.resilio.com/hc/en-us/articles/207370466</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.8" class="footnum" href="#fnr.8">8</a></sup> <div class="footpara"><p class="footpara">
<a href="https://help.resilio.com/hc/en-us/articles/115000401010-Sharing-single-file">https://help.resilio.com/hc/en-us/articles/115000401010-Sharing-single-file</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.9" class="footnum" href="#fnr.9">9</a></sup> <div class="footpara"><p class="footpara">
<a href="https://help.resilio.com/hc/en-us/articles/205450295-How-do-I-reset-my-WebUI-password">https://help.resilio.com/hc/en-us/articles/205450295-How-do-I-reset-my-WebUI-password</a>-
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: 刘尚亮</p>
<p class="email">Email: <a href="mailto:phenix3443@gmail.com">phenix3443@gmail.com</a></p>
<p class="date">Created: 2020-07-16 四 17:34</p>
<p class="validation"></p>
</div>
</body>
</html>
